Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.GetReferenceModelObjectGuidsByExternalGuids Method
 Gets reference model object guids by external guids.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<string> GetReferenceModelObjectGuidsByExternalGuids(
	List<string> externalGuids
)
Public Function GetReferenceModelObjectGuidsByExternalGuids (
	externalGuids As List(Of String)
) As List(Of String)
Parameters
externalGuids
Type: System.Collections.Generic.List<String>
The external guids.
Return Value
Type: List<String>
If successful, the reference model object guids.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace